rpruitt76/PLMPLS_41/r_bsp/mcu/rx62g/register_access/iodefine.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define DBRE9	DBRE09
#define DBRE8	DBRE08
#define DBRE7	DBRE07
#define DBRE6	DBRE06
#define DBRE5	DBRE05
#define DBRE4	DBRE04
#define DBRE3	DBRE03
#define DBRE2	DBRE02
#define DBRE1	DBRE01
#define DBRE0	DBRE00

#define DBWE9	DBWE09
#define DBWE8	DBWE08
#define DBWE7	DBWE07
#define DBWE6	DBWE06
#define DBWE5	DBWE05
#define DBWE4	DBWE04
#define DBWE3	DBWE03
#define DBWE2	DBWE02
#define DBWE1	DBWE01
#define DBWE0	DBWE00

#define LMD		L0MD
#define LBRK	L0BRK
#define LSPC	L0SPC
#define LWUP	L0WUP
#define LIE		L0IE
#define LEDE	L0EDE
#define LC		L0C
#define LTC		L0TC
#define LMST	L0MST
#define LST		L0ST
#define LEST	L0EST
#define LRFC	L0RFC
#define LIDB	L0IDB
#define LCBR	L0CBR
#define LDB1	L0DB1
#define LDB2	L0DB2
#define LDB3	L0DB3
#define LDB4	L0DB4
#define LDB5	L0DB5
#define LDB6	L0DB6
#define LDB7	L0DB7
#define LDB8	L0DB8


#define	AD0		(*(volatile struct st_ad     __evenaccess *)0x88040)
#define	BSC		(*(volatile struct st_bsc    __evenaccess *)0x81300)
#define	CAN0	(*(volatile struct st_can    __evenaccess *)0x90200)
#define	CMT		(*(volatile struct st_cmt    __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0   __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0   __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0   __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0   __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc    __evenaccess *)0x88280)
#define	DTC		(*(volatile struct st_dtc    __evenaccess *)0x82400)
#define	FLASH	(*(volatile struct st_flash  __evenaccess *)0x8C288)
#define	GPT		(*(volatile struct st_gpt    __evenaccess *)0xC2000)
#define	GPT0	(*(volatile struct st_gpt0   __evenaccess *)0xC2100)
#define	GPT1	(*(volatile struct st_gpt1   __evenaccess *)0xC2180)
#define	GPT2	(*(volatile struct st_gpt2   __evenaccess *)0xC2200)
#define	GPT3	(*(volatile struct st_gpt3   __evenaccess *)0xC2280)
#define	ICU		(*(volatile struct st_icu    __evenaccess *)0x87000)
#define	IOPORT	(*(volatile struct st_ioport __evenaccess *)0x8C108)
#define	IWDT	(*(volatile struct st_iwdt   __evenaccess *)0x88030)
#define	LIN0	(*(volatile struct st_lin    __evenaccess *)0x94001)
#define	MPU		(*(volatile struct st_mpu    __evenaccess *)0x86400)
#define	MTU		(*(volatile struct st_mtu    __evenaccess *)0xC120A)
#define	MTU0	(*(volatile struct st_mtu0   __evenaccess *)0xC1300)
#define	MTU1	(*(volatile struct st_mtu1   __evenaccess *)0xC1380)
#define	MTU2	(*(volatile struct st_mtu2   __evenaccess *)0xC1400)
#define	MTU3	(*(volatile struct st_mtu3   __evenaccess *)0xC1200)
#define	MTU4	(*(volatile struct st_mtu4   __evenaccess *)0xC1200)
#define	MTU5	(*(volatile struct st_mtu5   __evenaccess *)0xC1C80)
#define	MTU6	(*(volatile struct st_mtu3   __evenaccess *)0xC1A00)
#define	MTU7	(*(volatile struct st_mtu7   __evenaccess *)0xC1A00)
#define	POE		(*(volatile struct st_poe    __evenaccess *)0x8C4C0)
#define	PORT1	(*(volatile struct st_port1  __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2  __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3  __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4  __evenaccess *)0x8C044)
#define	PORT5	(*(volatile struct st_port5  __evenaccess *)0x8C045)
#define	PORT6	(*(volatile struct st_port6  __evenaccess *)0x8C046)
#define	PORT7	(*(volatile struct st_port7  __evenaccess *)0x8C007)
#define	PORT8	(*(volatile struct st_port8  __evenaccess *)0x8C008)
#define	PORT9	(*(volatile struct st_port9  __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta  __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb  __evenaccess *)0x8C00B)
#define	PORTD	(*(volatile struct st_portd  __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte  __evenaccess *)0x8C00E)
#define	PORTG	(*(volatile struct st_portg  __evenaccess *)0x8C010)
#define	RIIC0	(*(volatile struct st_riic   __evenaccess *)0x88300)
#define	RSPI0	(*(volatile struct st_rspi   __evenaccess *)0x88380)
#define	S12AD	(*(volatile struct st_s12ad  __evenaccess *)0x89012)
#define	S12AD0	(*(volatile struct st_s12ad0 __evenaccess *)0x89000)
#define	S12AD1	(*(volatile struct st_s12ad1 __evenaccess *)0x89080)
#define	SCI0	(*(volatile struct st_sci    __evenaccess *)0x88240)
#define	SCI1	(*(volatile struct st_sci    __evenaccess *)0x88248)
#define	SCI2	(*(volatile struct st_sci    __evenaccess *)0x88250)
#define	SMCI0	(*(volatile struct st_smci   __evenaccess *)0x88240)
#define	SMCI1	(*(volatile struct st_smci   __evenaccess *)0x88248)
#define	SMCI2	(*(volatile struct st_smci   __evenaccess *)0x88250)
#define	SYSTEM	(*(volatile struct st_system __evenaccess *)0x80000)
#define	WDT		(*(volatile union un_wdt     __evenaccess *)0x88028)
#pragma bit_order
#pragma packoption
#endif